src/InformationRegisters/НастройкиКонтрольПодключений/НастройкиКонтрольПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПодключений</name>
  <resources>
    <name>МаксимальнаяДатаПрочитанныхЗаписейСкрыто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>МеханизмПроверкиОбрабатыватьИзменения</name>
    <type>
      <types>EnumRef.МеханизмыПроверкиПодключения</types>
    </type>
  </resources>
  <resources>
    <name>URLОпубликованнойИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьЛогинПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПарольПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПроверятьПоЖурналуРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Таймаут</name>
    <comment>Максимальное время выполнения контрольной процедуры</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиКонтрольПодключений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Функция ПрочитатьНастройки(КонтрольнаяПроцедура) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    МенеджерЗаписи.Прочитать();
    
    Настройки = Новый Структура;
    
    Для Каждого ТекРесурс Из Метаданные.РегистрыСведений.НастройкиКонтрольПодключений.Ресурсы Цикл
        Настройки.Вставить(ТекРесурс.Имя, МенеджерЗаписи[ТекРесурс.Имя]);    
    КонецЦикла;
    
    УстановитьПривилегированныйРежим(Истина);
    Данные = РегистрыСведений.БезопасноеХранилище.ПолучитьДанные(КонтрольнаяПроцедура);
    УстановитьПривилегированныйРежим(Ложь);
    
    Если Данные <> Неопределено Тогда
        Настройки.Вставить("ЛогинПриПодключении", Данные.ЛогинПриПодключении);
        Настройки.Вставить("ПарольПриПодключении", Данные.ПарольПриПодключении);
    Иначе
        Настройки.Вставить("ЛогинПриПодключении", "");
        Настройки.Вставить("ПарольПриПодключении", "");
    КонецЕсли;
            
    Возврат Настройки;
    
КонецФункции

// Записать настройки
//
// Параметры:
//  КонтрольнаяПроцедура - СправочникСсылка.КонтрольныеПроцедуры - контрольная процедура, для которой записываются настройки.
//  Настройки            - Структура - структура создания с ключами:
//                                   — МеханизмПроверкиОбрабатыватьИзменения - ПеречислениеСсылка.МеханизмыПроверкиПодключения.
//                                   — URLОпубликованнойИнформационнойБазы   - Строка.
//                                   — Таймаут                               - Число, секунды.
//                                   — ЛогинПриПодключении                   - Строка.
//                                   — ПарольПриПодключении                  - Строка.
//                                   — ИспользоватьПрокси                    - Булево.
//                                   — ПроксиСервер                          - Строка, если ИспользоватьПрокси = Ложь, то необязателен.
//                                   — ПроксиПорт                            - Число, если ИспользоватьПрокси = Ложь, то необязателен.
//                                   — ПериодКонтроля                        - Число, секунды.
//                                   — МинимальныйПроцентДоступности         - Чилсо, %.
//                                   — ДопустимоНетДанных                    - Число, секунды
//
Процедура ЗаписатьНастройки(КонтрольнаяПроцедура, Настройки) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    МенеджерЗаписи.Прочитать();
    
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    
    Если Настройки.Свойство("МеханизмПроверкиОбрабатыватьИзменения") Тогда
        МенеджерЗаписи.МеханизмПроверкиОбрабатыватьИзменения = Настройки.МеханизмПроверкиОбрабатыватьИзменения;
    КонецЕсли;
    
    Если Настройки.Свойство("URLОпубликованнойИнформационнойБазы") Тогда
        МенеджерЗаписи.URLОпубликованнойИнформационнойБазы = Настройки.URLОпубликованнойИнформационнойБазы;
    КонецЕсли;
    
    Если Настройки.Свойство("СтрокаСоединения") Тогда
        МенеджерЗаписи.СтрокаСоединения = Настройки.СтрокаСоединения;
    КонецЕсли;
    
    Если Настройки.Свойство("Таймаут") Тогда
        МенеджерЗаписи.Таймаут = Настройки.Таймаут;
    КонецЕсли;
    
    Если Настройки.Свойство("ИспользоватьПрокси") Тогда
        МенеджерЗаписи.ИспользоватьПрокси = Настройки.ИспользоватьПрокси;
    КонецЕсли;
    
    Если Настройки.Свойство("ПроксиСервер") Тогда
        МенеджерЗаписи.ПроксиСервер = Настройки.ПроксиСервер;
    КонецЕсли;
    
    Если Настройки.Свойство("ПроксиПорт") Тогда
        МенеджерЗаписи.ПроксиПорт = Настройки.ПроксиПорт;
    КонецЕсли;
    
    Если Настройки.Свойство("ПериодКонтроля") Тогда
        МенеджерЗаписи.ПериодКонтроля = Настройки.ПериодКонтроля;
    КонецЕсли;
    
    Если Настройки.Свойство("МинимальныйПроцентДоступности") Тогда
        МенеджерЗаписи.МинимальныйПроцентДоступности = Настройки.МинимальныйПроцентДоступности;
    КонецЕсли;
    
    Если Настройки.Свойство("ДопустимоНетДанных") Тогда
        МенеджерЗаписи.ДопустимоНетДанных = Настройки.ДопустимоНетДанных;
    КонецЕсли;
    
    МенеджерЗаписи.Записать(Истина);
    
    УстановитьПривилегированныйРежим(Истина);
    Данные = РегистрыСведений.БезопасноеХранилище.ПолучитьДанные(КонтрольнаяПроцедура);
    УстановитьПривилегированныйРежим(Ложь);
    
    Если Данные = Неопределено Тогда
        Данные = Новый Структура("ЛогинПриПодключении, ПарольПриПодключении", "", "");
    КонецЕсли;
    
    ЕстьЗапись = Ложь;
    Если Настройки.Свойство("ЛогинПриПодключении") Тогда
        Данные.ЛогинПриПодключении = Настройки.ЛогинПриПодключении;
        ЕстьЗапись = Истина;
    КонецЕсли;
    Если Настройки.Свойство("ПарольПриПодключении") Тогда
        Данные.ПарольПриПодключении = Настройки.ПарольПриПодключении;
        ЕстьЗапись = Истина;
    КонецЕсли;
    
    Если ЕстьЗапись Тогда
        УстановитьПривилегированныйРежим(Истина);
        РегистрыСведений.БезопасноеХранилище.ЗаписатьДанные(КонтрольнаяПроцедура, Данные);
        УстановитьПривилегированныйРежим(Ложь);
    КонецЕсли;
   
КонецПроцедуры

#КонецОбласти

#КонецЕсли
